app/controllers/waypoints_controller.rb

  def create
    waypoint = Waypoint.new(location: "POINT(#{params[:lng]} #{params[:lat]})", description: params[:description], dropped_by: params[:dropper])
    if waypoint.save
---
INSERT INTO "waypoints" ("location", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["location", "0020000001000010e64044f02457ce1d2fc055e9cbfd99f433"], ["created_at", 2017-02-26 23:18:07 UTC], ["updated_at", 2017-02-26 23:18:07 UTC]]